export const portfolioText = `*Обо мне (для раздела "Портфолио")*

Здравствуйте! Меня зовут Александр. Я — Frontend-разработчик с 3-летним опытом, специализирующийся на создании интерактивных и удобных пользовательских интерфейсов.

*Моя ключевая экспертиза — разработка Telegram-ботов на Node.js.* Я создаю ботов с нуля: от проектирования архитектуры до развертывания на сервере. Владею библиотекой 
node-telegram-bot-api
, умею настраивать кастомные клавиатуры, обрабатывать команды и создавать интерактивные меню.

В качестве примера моих возможностей, я самостоятельно реализовал pet-проект "График цен на биткойн" ([ссылка на GitHub](https://github.com/Talex210/chart-prices-bitcoin)), используя *Nuxt 3, Vue 3, Node.js, PostgreSQL и Docker*. Этот проект демонстрирует мой опыт в работе с API, обработке данных и их визуализации — навыки, которые я успешно применяю для создания функциональных ботов. Например, в вашем боте я могу реализовать отображение данных (как курсы валют) в виде наглядных графиков, используя *D3.js* или *Recharts*.

Я эффективно взаимодействую с командой и всегда ориентируюсь на цели бизнеса, предлагая решения, которые будут не только технически грамотными, но и удобными для конечного пользователя.`;

export const skillsText = `*Ключевые навыки (для раздела "Навыки")*

*Telegram-боты:*
• *Языки и среда:* JavaScript, TypeScript, Node.js
• *Библиотеки:* node-telegram-bot-api

• *Возможности:* Разработка ботов с нуля, кастомные клавиатуры, команды, обработка сообщений, интеграция с API.

*Frontend:*
• *Языки:* JavaScript, TypeScript, HTML5, CSS3
• *Фреймворки:* React, Vue 3, Nuxt 3
• *Управление состоянием:* MobX

*Визуализация данных:*
• *Библиотеки:* D3.js, Recharts

*Backend и базы данных:*
• *Среда:* Node.js
• *Базы данных:* PostgreSQL

*Инструменты и развертывание:*
• *Системы контроля версий:* Git, GitHub
• *Контейнеризация:* Docker
• *Инструменты сборки:* Webpack, Vite`;